#pragma once
#include <stdint.h>

// Базовая длина копирования для статического дефлята
const uint8_t staticDeflate_LengthOfCommand[] = {
    3, 4, 5, 6, 7, 8, 9, 10,  // 257-264
    11, 13, 15, 17,           // 265-268 (1 доп. бит)
    19, 23, 27, 31,           // 269-272 (2 доп. бита)
    35, 43, 51, 59,           // 273-276 (3 доп. бита)
    67, 83, 99, 115,          // 277-280 (4 доп. бита)
    131, 163, 195, 227,        // 281-284 (5 доп. битов)
    258
};

// Длины дистанций для статического дефлята
const uint8_t staticDeflate_LenOfDistance[] = {
    1, 2, 3, 4,               // коды 0-3
    5, 7, 9, 13,              // коды 4-7
    17, 25, 33, 49,           // коды 8-11
    65, 97, 129, 193,         // коды 12-15
    257, 385, 513, 769,       // коды 16-19
    1025, 1537, 2049, 3073,   // коды 20-23
    4097, 6145, 8193, 12289,  // коды 24-27
    16385, 24577              // коды 28-29
};

// Количество дополнительных бит для чтения дистанций для статического дефлята
const uint8_t staticDeflate_ExtraBitsDistance[] = {
    0, 0, 0, 0,               // коды 0-3
    1, 1, 2, 2,               // коды 4-7
    3, 3, 4, 4,               // коды 8-11
    5, 5, 6, 6,               // коды 12-15
    7, 7, 8, 8,               // коды 16-19
    9, 9, 10, 10,             // коды 20-23
    11, 11, 12, 12,           // коды 24-27
    13, 13                    // коды 28-29
};

// Таблица порядка чтения кодов длин для таблицы кодов длин для динамического дефлята
const uint8_t dynamicDeflate_HowToReadCodeLengthsForCodeLengths[] = {
    16, 17, 18, 0,
    8, 7, 9, 6,
    10, 5, 11, 4,
    12, 3, 13, 2,
    14, 1, 15
};

// Таблица базовых длин для динамического дефлята
const uint16_t dynamicDeflate_LengthOfBaseDistance[] = {
    3, 4, 5, 6, 7, 8, 9, 10,           // 257-264
    11, 13, 15, 17,                    // 265-268
    19, 23, 27, 31,                    // 269-272
    35, 43, 51, 59,                    // 273-276
    67, 83, 99, 115,                   // 277-280
    131, 163, 195, 227,                 // 281-284
    258
};

// Таблица доп. битов для динамического дефлята
const uint8_t dynamicDeflate_CountOfExtraBitsDistance[] = {
    0, 0, 0, 0, 0, 0, 0, 0,            // 257-264
    1, 1, 1, 1,                        // 265-268
    2, 2, 2, 2,                        // 269-272
    3, 3, 3, 3,                        // 273-276
    4, 4, 4, 4,                        // 277-280
    5, 5, 5, 5,                         // 281-284
    0
};

// Таблица базовых расстояний для динамического дефлята
const uint16_t dynamicDeflate_BaseDistForAlphabetOfDist[] = {
    1, 2, 3, 4,           // 0-3
    5, 7, 9, 13,          // 4-7
    17, 25, 33, 49,       // 8-11
    65, 97, 129, 193,     // 12-15
    257, 385, 513, 769,   // 16-19
    1025, 1537, 2049, 3073, // 20-23
    4097, 6145, 8193, 12289, // 24-27
    16385, 24577          // 28-29
};

// Таблица доп. битов для динамического дефлята
const uint8_t dynamicDeflate_ExtraBitsForAlphabetOfDist[] = {
    0, 0, 0, 0,           // 0-3
    1, 1, 2, 2,           // 4-7
    3, 3, 4, 4,           // 8-11
    5, 5, 6, 6,           // 12-15
    7, 7, 7, 7,           // 16-19
    7, 7, 7, 7,           // 20-23
    7, 7, 7, 7,           // 24-27
    7, 7                  // 28-29
};